#include <print>
#include <iostream>
#include <termcolor/termcolor.hpp>

using std::cout;
using std::endl;
using std::println;

void help() {
  println();
  println("  ██████╗░██╗███████╗███████╗███████╗██████╗░");
  println("  ██╔══██╗██║██╔════╝██╔════╝██╔════╝██╔══██╗");
  println("  ██║░░██║██║█████╗░░█████╗░░█████╗░░██████╔╝");
  println("  ██║░░██║██║██╔══╝░░██╔══╝░░██╔══╝░░██╔══██╗");
  println("  ██████╔╝██║██║░░░░░██║░░░░░███████╗██║░░██║");
  println("  ╚═════╝░╚═╝╚═╝░░░░░╚═╝░░░░░╚══════╝╚═╝░░╚═╝");
  println();
  cout << termcolor::bold << "Command line Prompt" << termcolor::reset << ":" << endl;
  println("  - generate Generate multiple difference files based on template files.");
  println("  - validate Validate the syntax of file at different stages.");
  println();
}
